import { ButtonLink } from './button-link'

import pattern from '../public/images/tehran-banner-pattern.png'
import Image from 'next/image'

export function TehranBanner() {
  return (
    <section className="relative flex flex-col gap-5 rounded-[20px] bg-primary bg-[url('/images/banner-pattern.png')] bg-right-bottom bg-no-repeat p-6 text-center text-white lg:gap-7 lg:p-8 lg:text-start">
      <h2 className="flex items-center justify-center text-xl font-light lg:justify-start lg:text-2xl">
        <span className="relative ml-4 inline-flex">
          <svg
            width="62"
            height="62"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g clipPath="url(#a)">
              <path
                d="M61.092 56.373H36.429a.908.908 0 1 1 0-1.816h3.042l-2.277-13.142c-.707-4.034-3.367-7.073-6.194-7.073-2.826 0-5.485 3.036-6.194 7.067l-1.77 10.142a.908.908 0 1 1-1.79-.31l1.764-10.105.002-.008.005-.031 1.196-6.904a.701.701 0 0 1 .007-.04c.339-1.963.596-4.145.785-6.877-1.043 3.062-2.495 5.478-4.452 7.659L2.943 54.557h17.743l.601-3.47a.908.908 0 1 1 1.79.31l-.548 3.16h3.042a.908.908 0 1 1 0 1.816H.908a.908.908 0 0 1-.676-1.515l16.762-18.677c.882-5.261 1.195-12.605 1.195-27.83 0-.501.407-.908.908-.908h3.419l3.44-1.72a.91.91 0 0 1 .538-.087L31 6.292l4.491-.653a.91.91 0 0 1 .568.092l3.425 1.712h3.419c.501 0 .908.407.908.908 0 15.225.313 22.569 1.194 27.83l6.906 7.606A.908.908 0 1 1 50.559 45l-9.112-10.065c-1.957-2.18-3.409-4.597-4.452-7.658.19 2.733.446 4.914.785 6.876l.007.04 1.197 6.91.004.025.001.007 2.325 13.422h17.742l-8.325-9.277a.908.908 0 1 1 1.351-1.214l9.686 10.793a.908.908 0 0 1-.676 1.514ZM31 32.526c1.817 0 3.616.868 5.079 2.447l-.052-.296c-.39-.562-1.858-2.594-3.817-4.299-.313-.272-.74-.649-1.21-1.067-.47.419-.897.795-1.21 1.067-1.966 1.71-3.428 3.737-3.817 4.3l-.052.295c1.463-1.58 3.262-2.447 5.079-2.447ZM20.005 9.26c-.01 12.345-.24 19.428-.835 24.497l.031-.035a19.65 19.65 0 0 0 1.972-2.59c.309-3.127.488-6.975.578-12.445a.908.908 0 0 1 1.816.03c-.05 3.06-.129 5.622-.242 7.838 1.455-4.336 2.063-10.087 2.125-18.548l-1.812.906c-.001 2.372-.01 4.476-.028 6.415a.908.908 0 0 1-.908.9h-.009a.908.908 0 0 1-.9-.916c.018-1.84.027-3.827.029-6.052h-1.817Zm20.822 21.873c.585.92 1.24 1.774 1.972 2.589l.031.035c-.594-5.07-.825-12.152-.835-24.497h-1.816c.01 10.936.2 17.331.648 21.873Zm-8.463-3.04c.403.358.765.677 1.038.915a23.517 23.517 0 0 1 1.982 1.956l-.22-1.271a7.627 7.627 0 0 0-1.214-3.023l-1.586 1.423ZM28.05 26.67a7.625 7.625 0 0 0-1.214 3.023l-.22 1.27a23.502 23.502 0 0 1 1.982-1.955c.274-.238.635-.557 1.038-.915L28.05 26.67Zm1.17-1.391L31 26.877c.675-.605 1.328-1.19 1.78-1.598L31 23.294l-1.78 1.985Zm7.33-17.272c.062 8.466.67 14.218 2.127 18.554-.215-4.225-.31-9.788-.315-17.648l-1.812-.906ZM31 21.027c.258 0 .504.11.676.301l3.063 3.413c.106.118.209.24.309.364-.143-2.808-.232-6.144-.278-10.26l-3.64.53a.91.91 0 0 1-.26 0l-3.64-.53c-.046 4.116-.135 7.452-.277 10.26.1-.125.202-.246.308-.364l3.063-3.413a.908.908 0 0 1 .676-.302Zm-3.752-8.015 3.752.546 3.752-.546c-.005-.584-.009-1.182-.012-1.796l-3.61.525a.91.91 0 0 1-.26 0l-3.61-.525c-.003.614-.007 1.212-.012 1.796Zm.02-3.63L31 9.925l3.733-.543-.004-1.797-3.598.523a.91.91 0 0 1-.262 0l-3.598-.523-.004 1.797Z"
                fill="#fff"
              />
            </g>
            <defs>
              <clipPath id="a">
                <path fill="#fff" d="M0 0h62v62H0z" />
              </clipPath>
            </defs>
          </svg>
          <span className="absolute -right-4 top-1/2 inline-block h-[10px] w-[10px] rounded-full border border-white"></span>
          <span className="absolute -bottom-3 right-1/2 inline-block h-[6px] w-[6px] rounded-full bg-white"></span>
          <span className="absolute left-0 top-0 inline-block h-[3px] w-[3px] bg-white"></span>
        </span>
        <strong className="ml-1 font-black">تهرانگردی </strong>
        با برترین ها
      </h2>
      <div className="flex flex-col items-center gap-5 lg:flex-row lg:justify-between lg:gap-7">
        <p className="max-w-xl text-base font-normal">
          برای آشنایی با جاذبه های گردشگی, رستوران ها, کافی شاپ ها, مکانهای
          تفریحی و ... تهران پیشنهاد میکنیم به مطالب زیر نگاهی بیاندازید.
        </p>
        <ButtonLink
          href="/tehran"
          label="آرشیو مطالب تهرانگردی"
          color="white"
        />
      </div>
      <Image src={pattern} alt="pattern" className="absolute left-0 top-0" />
    </section>
  )
}
